#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

[0m[1maws_s3_bucket.import-bucket-rafael: Refreshing state... [id=rafael-import-bucket][0m
[0m[1mdata.aws_availability_zones.azs: Reading...[0m[0m
[0m[1maws_vpc.vpc_rafael: Refreshing state... [id=vpc-0a9aa693e699b693d][0m
[0m[1mmodule.github-oidc.aws_iam_openid_connect_provider.this[0]: Refreshing state... [id=arn:aws:iam::430137661482:oidc-provider/token.actions.githubusercontent.com][0m
[0m[1mdata.aws_ami.latest_amazon_linux_2: Reading...[0m[0m
[0m[1mmodule.github-oidc.data.aws_iam_policy_document.this: Reading...[0m[0m
[0m[1mmodule.github-oidc.data.aws_iam_policy_document.this: Read complete after 0s [id=2674139682][0m
[0m[1mmodule.github-oidc.aws_iam_role.this[0]: Refreshing state... [id=github-oidc-provider-aws][0m
[0m[1mdata.aws_availability_zones.azs: Read complete after 0s [id=us-east-1][0m
[0m[1mmodule.github-oidc.aws_iam_role_policy_attachment.attach[0]: Refreshing state... [id=github-oidc-provider-aws-20230825142435187800000003][0m
[0m[1mdata.aws_ami.latest_amazon_linux_2: Read complete after 1s [id=ami-0e1c5d8c23330dee3][0m
[0m[1mmodule.server1["db"].tls_private_key.rfa-key-lab: Refreshing state... [id=f1cd7a43d19cc679cb0dbbcf6ea0300586ae8e4c][0m
[0m[1mmodule.server1["web"].tls_private_key.rfa-key-lab: Refreshing state... [id=b57dcc8e12bb80b202654309fa26faf6b11e379e][0m
[0m[1maws_security_group.allow_tls["db"]: Refreshing state... [id=sg-07730d38bceccfa32][0m
[0m[1maws_security_group.sg-terraform: Refreshing state... [id=sg-0af9b87c132122a96][0m
[0m[1maws_internet_gateway.terraform-igw: Refreshing state... [id=igw-045fac48b6f6ee836][0m
[0m[1maws_security_group.allow_tls["web"]: Refreshing state... [id=sg-0043d359815ee5a91][0m
[0m[1maws_subnet.rafael_subnet_pub: Refreshing state... [id=subnet-08acc96cfe1f30798][0m
[0m[1mmodule.server1["web"].aws_key_pair.rfa-key-pair: Refreshing state... [id=rfa-terraform-lab20230824231841510600000001][0m
[0m[1mmodule.server1["db"].aws_key_pair.rfa-key-pair: Refreshing state... [id=rfa-terraform-lab20230824231841588800000002][0m
[0m[1maws_security_group.sg-terraform-db: Refreshing state... [id=sg-0acfa96fc70ceefeb][0m
[0m[1maws_route_table.rfa-rtb: Refreshing state... [id=rtb-03462be00bfad37ac][0m
[0m[1maws_route_table_association.this: Refreshing state... [id=rtbassoc-0c44f1aafed64aa89][0m
[0m[1mmodule.server1["web"].aws_instance.instance-apache: Refreshing state... [id=i-03cc1db15be69a72f][0m
[0m[1mmodule.server1["db"].aws_instance.instance-apache: Refreshing state... [id=i-02ec003417bd2c117][0m

[1m[36mNote:[0m[1m Objects have changed outside of Terraform
[0m
Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # module.server1["db"].aws_instance.instance-apache[0m has been deleted
[0m  [31m-[0m[0m resource "aws_instance" "instance-apache" {
      [31m-[0m[0m id                                   = "i-02ec003417bd2c117" [90m-> null[0m[0m
      [31m-[0m[0m private_ip                           = "10.0.0.211" [90m-> null[0m[0m
      [31m-[0m[0m public_ip                            = "44.197.187.95" [90m-> null[0m[0m
        tags                                 = {
            "Name" = "rafael-terraform-db"
        }
        [90m# (31 unchanged attributes hidden)[0m[0m

        [90m# (8 unchanged blocks hidden)[0m[0m
    }

[1m  # module.server1["web"].aws_instance.instance-apache[0m has been deleted
[0m  [31m-[0m[0m resource "aws_instance" "instance-apache" {
      [31m-[0m[0m id                                   = "i-03cc1db15be69a72f" [90m-> null[0m[0m
      [31m-[0m[0m private_ip                           = "10.0.0.157" [90m-> null[0m[0m
      [31m-[0m[0m public_ip                            = "3.221.155.230" [90m-> null[0m[0m
        tags                                 = {
            "Name" = "rafael-terraform-web"
        }
        [90m# (31 unchanged attributes hidden)[0m[0m

        [90m# (8 unchanged blocks hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m

Terraform will perform the following actions:

[1m  # aws_db_instance.db-rafael[0m will be created
[0m  [32m+[0m[0m resource "aws_db_instance" "db-rafael" {
      [32m+[0m[0m address                               = (known after apply)
      [32m+[0m[0m allocated_storage                     = (known after apply)
      [32m+[0m[0m apply_immediately                     = false
      [32m+[0m[0m arn                                   = (known after apply)
      [32m+[0m[0m auto_minor_version_upgrade            = true
      [32m+[0m[0m availability_zone                     = (known after apply)
      [32m+[0m[0m backup_retention_period               = (known after apply)
      [32m+[0m[0m backup_target                         = (known after apply)
      [32m+[0m[0m backup_window                         = (known after apply)
      [32m+[0m[0m ca_cert_identifier                    = (known after apply)
      [32m+[0m[0m character_set_name                    = (known after apply)
      [32m+[0m[0m copy_tags_to_snapshot                 = false
      [32m+[0m[0m db_name                               = (known after apply)
      [32m+[0m[0m db_subnet_group_name                  = "default-vpc-08cd1341b8b63ae43"
      [32m+[0m[0m delete_automated_backups              = true
      [32m+[0m[0m endpoint                              = (known after apply)
      [32m+[0m[0m engine                                = "mysql"
      [32m+[0m[0m engine_version                        = (known after apply)
      [32m+[0m[0m engine_version_actual                 = (known after apply)
      [32m+[0m[0m hosted_zone_id                        = (known after apply)
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m identifier                            = "db-import-terraform"
      [32m+[0m[0m identifier_prefix                     = (known after apply)
      [32m+[0m[0m instance_class                        = "db.t3.micro"
      [32m+[0m[0m iops                                  = (known after apply)
      [32m+[0m[0m kms_key_id                            = (known after apply)
      [32m+[0m[0m latest_restorable_time                = (known after apply)
      [32m+[0m[0m license_model                         = (known after apply)
      [32m+[0m[0m listener_endpoint                     = (known after apply)
      [32m+[0m[0m maintenance_window                    = (known after apply)
      [32m+[0m[0m master_user_secret                    = (known after apply)
      [32m+[0m[0m master_user_secret_kms_key_id         = (known after apply)
      [32m+[0m[0m monitoring_interval                   = 0
      [32m+[0m[0m monitoring_role_arn                   = (known after apply)
      [32m+[0m[0m multi_az                              = (known after apply)
      [32m+[0m[0m nchar_character_set_name              = (known after apply)
      [32m+[0m[0m network_type                          = (known after apply)
      [32m+[0m[0m option_group_name                     = (known after apply)
      [32m+[0m[0m parameter_group_name                  = "default.mysql8.0"
      [32m+[0m[0m performance_insights_enabled          = false
      [32m+[0m[0m performance_insights_kms_key_id       = (known after apply)
      [32m+[0m[0m performance_insights_retention_period = (known after apply)
      [32m+[0m[0m port                                  = 3306
      [32m+[0m[0m publicly_accessible                   = true
      [32m+[0m[0m replica_mode                          = (known after apply)
      [32m+[0m[0m replicas                              = (known after apply)
      [32m+[0m[0m resource_id                           = (known after apply)
      [32m+[0m[0m skip_final_snapshot                   = true
      [32m+[0m[0m snapshot_identifier                   = (known after apply)
      [32m+[0m[0m status                                = (known after apply)
      [32m+[0m[0m storage_throughput                    = (known after apply)
      [32m+[0m[0m storage_type                          = (known after apply)
      [32m+[0m[0m tags_all                              = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManegedBy"   = "Terraform"
          [32m+[0m[0m "Owner"       = "rafael"
        }
      [32m+[0m[0m timezone                              = (known after apply)
      [32m+[0m[0m username                              = "admin"
      [32m+[0m[0m vpc_security_group_ids                = [
          [32m+[0m[0m "sg-0af9b87c132122a96",
        ]
    }

[1m  # aws_security_group.allow_tls["db"][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_security_group" "allow_tls" {
        id                     = "sg-07730d38bceccfa32"
        name                   = "rafael-terraform-db-sg"
      [33m~[0m[0m tags                   = {
          [33m~[0m[0m "Name" = "allow_tls" [33m->[0m[0m "rafael-terraform-sg"
        }
      [33m~[0m[0m tags_all               = {
          [33m~[0m[0m "Name"        = "allow_tls" [33m->[0m[0m "rafael-terraform-sg"
            [90m# (3 unchanged elements hidden)[0m[0m
        }
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_security_group.allow_tls["web"][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_security_group" "allow_tls" {
        id                     = "sg-0043d359815ee5a91"
        name                   = "rafael-terraform-web-sg"
      [33m~[0m[0m tags                   = {
          [33m~[0m[0m "Name" = "allow_tls" [33m->[0m[0m "rafael-terraform-sg"
        }
      [33m~[0m[0m tags_all               = {
          [33m~[0m[0m "Name"        = "allow_tls" [33m->[0m[0m "rafael-terraform-sg"
            [90m# (3 unchanged elements hidden)[0m[0m
        }
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # module.server1["db"].aws_instance.instance-apache[0m will be created
[0m  [32m+[0m[0m resource "aws_instance" "instance-apache" {
      [32m+[0m[0m ami                                  = "ami-0e1c5d8c23330dee3"
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m associate_public_ip_address          = true
      [32m+[0m[0m availability_zone                    = (known after apply)
      [32m+[0m[0m cpu_core_count                       = (known after apply)
      [32m+[0m[0m cpu_threads_per_core                 = (known after apply)
      [32m+[0m[0m disable_api_stop                     = (known after apply)
      [32m+[0m[0m disable_api_termination              = (known after apply)
      [32m+[0m[0m ebs_optimized                        = (known after apply)
      [32m+[0m[0m get_password_data                    = false
      [32m+[0m[0m host_id                              = (known after apply)
      [32m+[0m[0m host_resource_group_arn              = (known after apply)
      [32m+[0m[0m iam_instance_profile                 = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)
      [32m+[0m[0m instance_lifecycle                   = (known after apply)
      [32m+[0m[0m instance_state                       = (known after apply)
      [32m+[0m[0m instance_type                        = "t2.micro"
      [32m+[0m[0m ipv6_address_count                   = (known after apply)
      [32m+[0m[0m ipv6_addresses                       = (known after apply)
      [32m+[0m[0m key_name                             = "rfa-terraform-lab20230824231841588800000002"
      [32m+[0m[0m monitoring                           = (known after apply)
      [32m+[0m[0m outpost_arn                          = (known after apply)
      [32m+[0m[0m password_data                        = (known after apply)
      [32m+[0m[0m placement_group                      = (known after apply)
      [32m+[0m[0m placement_partition_number           = (known after apply)
      [32m+[0m[0m primary_network_interface_id         = (known after apply)
      [32m+[0m[0m private_dns                          = (known after apply)
      [32m+[0m[0m private_ip                           = (known after apply)
      [32m+[0m[0m public_dns                           = (known after apply)
      [32m+[0m[0m public_ip                            = (known after apply)
      [32m+[0m[0m secondary_private_ips                = (known after apply)
      [32m+[0m[0m security_groups                      = (known after apply)
      [32m+[0m[0m source_dest_check                    = true
      [32m+[0m[0m spot_instance_request_id             = (known after apply)
      [32m+[0m[0m subnet_id                            = "subnet-08acc96cfe1f30798"
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Name" = "rafael-terraform-db"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManegedBy"   = "Terraform"
          [32m+[0m[0m "Name"        = "rafael-terraform-db"
          [32m+[0m[0m "Owner"       = "rafael"
        }
      [32m+[0m[0m tenancy                              = (known after apply)
      [32m+[0m[0m user_data                            = "dd633f44ad53d38eea824d9fd0f1c3eb0aec4096"
      [32m+[0m[0m user_data_base64                     = (known after apply)
      [32m+[0m[0m user_data_replace_on_change          = true
      [32m+[0m[0m vpc_security_group_ids               = [
          [32m+[0m[0m "sg-0af9b87c132122a96",
        ]
    }

[1m  # module.server1["web"].aws_instance.instance-apache[0m will be created
[0m  [32m+[0m[0m resource "aws_instance" "instance-apache" {
      [32m+[0m[0m ami                                  = "ami-0e1c5d8c23330dee3"
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m associate_public_ip_address          = true
      [32m+[0m[0m availability_zone                    = (known after apply)
      [32m+[0m[0m cpu_core_count                       = (known after apply)
      [32m+[0m[0m cpu_threads_per_core                 = (known after apply)
      [32m+[0m[0m disable_api_stop                     = (known after apply)
      [32m+[0m[0m disable_api_termination              = (known after apply)
      [32m+[0m[0m ebs_optimized                        = (known after apply)
      [32m+[0m[0m get_password_data                    = false
      [32m+[0m[0m host_id                              = (known after apply)
      [32m+[0m[0m host_resource_group_arn              = (known after apply)
      [32m+[0m[0m iam_instance_profile                 = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)
      [32m+[0m[0m instance_lifecycle                   = (known after apply)
      [32m+[0m[0m instance_state                       = (known after apply)
      [32m+[0m[0m instance_type                        = "t2.micro"
      [32m+[0m[0m ipv6_address_count                   = (known after apply)
      [32m+[0m[0m ipv6_addresses                       = (known after apply)
      [32m+[0m[0m key_name                             = "rfa-terraform-lab20230824231841510600000001"
      [32m+[0m[0m monitoring                           = (known after apply)
      [32m+[0m[0m outpost_arn                          = (known after apply)
      [32m+[0m[0m password_data                        = (known after apply)
      [32m+[0m[0m placement_group                      = (known after apply)
      [32m+[0m[0m placement_partition_number           = (known after apply)
      [32m+[0m[0m primary_network_interface_id         = (known after apply)
      [32m+[0m[0m private_dns                          = (known after apply)
      [32m+[0m[0m private_ip                           = (known after apply)
      [32m+[0m[0m public_dns                           = (known after apply)
      [32m+[0m[0m public_ip                            = (known after apply)
      [32m+[0m[0m secondary_private_ips                = (known after apply)
      [32m+[0m[0m security_groups                      = (known after apply)
      [32m+[0m[0m source_dest_check                    = true
      [32m+[0m[0m spot_instance_request_id             = (known after apply)
      [32m+[0m[0m subnet_id                            = "subnet-08acc96cfe1f30798"
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Name" = "rafael-terraform-web"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManegedBy"   = "Terraform"
          [32m+[0m[0m "Name"        = "rafael-terraform-web"
          [32m+[0m[0m "Owner"       = "rafael"
        }
      [32m+[0m[0m tenancy                              = (known after apply)
      [32m+[0m[0m user_data                            = "d20b222110089d15c96b5bf09a4862c0efa321de"
      [32m+[0m[0m user_data_base64                     = (known after apply)
      [32m+[0m[0m user_data_replace_on_change          = true
      [32m+[0m[0m vpc_security_group_ids               = [
          [32m+[0m[0m "sg-0af9b87c132122a96",
        ]
    }

[1m  # module.server1["web1"].aws_instance.instance-apache[0m will be created
[0m  [32m+[0m[0m resource "aws_instance" "instance-apache" {
      [32m+[0m[0m ami                                  = "ami-0e1c5d8c23330dee3"
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m associate_public_ip_address          = true
      [32m+[0m[0m availability_zone                    = (known after apply)
      [32m+[0m[0m cpu_core_count                       = (known after apply)
      [32m+[0m[0m cpu_threads_per_core                 = (known after apply)
      [32m+[0m[0m disable_api_stop                     = (known after apply)
      [32m+[0m[0m disable_api_termination              = (known after apply)
      [32m+[0m[0m ebs_optimized                        = (known after apply)
      [32m+[0m[0m get_password_data                    = false
      [32m+[0m[0m host_id                              = (known after apply)
      [32m+[0m[0m host_resource_group_arn              = (known after apply)
      [32m+[0m[0m iam_instance_profile                 = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)
      [32m+[0m[0m instance_lifecycle                   = (known after apply)
      [32m+[0m[0m instance_state                       = (known after apply)
      [32m+[0m[0m instance_type                        = "t2.micro"
      [32m+[0m[0m ipv6_address_count                   = (known after apply)
      [32m+[0m[0m ipv6_addresses                       = (known after apply)
      [32m+[0m[0m key_name                             = (known after apply)
      [32m+[0m[0m monitoring                           = (known after apply)
      [32m+[0m[0m outpost_arn                          = (known after apply)
      [32m+[0m[0m password_data                        = (known after apply)
      [32m+[0m[0m placement_group                      = (known after apply)
      [32m+[0m[0m placement_partition_number           = (known after apply)
      [32m+[0m[0m primary_network_interface_id         = (known after apply)
      [32m+[0m[0m private_dns                          = (known after apply)
      [32m+[0m[0m private_ip                           = (known after apply)
      [32m+[0m[0m public_dns                           = (known after apply)
      [32m+[0m[0m public_ip                            = (known after apply)
      [32m+[0m[0m secondary_private_ips                = (known after apply)
      [32m+[0m[0m security_groups                      = (known after apply)
      [32m+[0m[0m source_dest_check                    = true
      [32m+[0m[0m spot_instance_request_id             = (known after apply)
      [32m+[0m[0m subnet_id                            = "subnet-08acc96cfe1f30798"
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Name" = "rafael-terraform-web1"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManegedBy"   = "Terraform"
          [32m+[0m[0m "Name"        = "rafael-terraform-web1"
          [32m+[0m[0m "Owner"       = "rafael"
        }
      [32m+[0m[0m tenancy                              = (known after apply)
      [32m+[0m[0m user_data                            = "86299421712567790a868bede8b39905786cffed"
      [32m+[0m[0m user_data_base64                     = (known after apply)
      [32m+[0m[0m user_data_replace_on_change          = true
      [32m+[0m[0m vpc_security_group_ids               = [
          [32m+[0m[0m "sg-0af9b87c132122a96",
        ]
    }

[1m  # module.server1["web1"].aws_key_pair.rfa-key-pair[0m will be created
[0m  [32m+[0m[0m resource "aws_key_pair" "rfa-key-pair" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m fingerprint     = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m key_name        = (known after apply)
      [32m+[0m[0m key_name_prefix = "rfa-terraform-lab"
      [32m+[0m[0m key_pair_id     = (known after apply)
      [32m+[0m[0m key_type        = (known after apply)
      [32m+[0m[0m public_key      = (known after apply)
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManegedBy"   = "Terraform"
          [32m+[0m[0m "Owner"       = "rafael"
        }
    }

[1m  # module.server1["web1"].tls_private_key.rfa-key-lab[0m will be created
[0m  [32m+[0m[0m resource "tls_private_key" "rfa-key-lab" {
      [32m+[0m[0m algorithm                     = "RSA"
      [32m+[0m[0m ecdsa_curve                   = "P224"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m private_key_openssh           = (sensitive value)
      [32m+[0m[0m private_key_pem               = (sensitive value)
      [32m+[0m[0m private_key_pem_pkcs8         = (sensitive value)
      [32m+[0m[0m public_key_fingerprint_md5    = (known after apply)
      [32m+[0m[0m public_key_fingerprint_sha256 = (known after apply)
      [32m+[0m[0m public_key_openssh            = (known after apply)
      [32m+[0m[0m public_key_pem                = (known after apply)
      [32m+[0m[0m rsa_bits                      = 2048
    }

[1mPlan:[0m 6 to add, 2 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @Rafael-Souza98, Action: `pull_request`*